# Вводим необходимые данные
b = float(input("Введите значение первого элемента геометрической погрессии "))
q = float(input("Введите значение множетеля геометрической погрессии "))
n = float(input("Введите номер последнего элемента геометрической погрессии "))

# считаем сумму
if q == 1:                          # так как по привычной формуле при q == 1 происходит деление на 0 то в данном случие будем использовать другую формулу S=n*b
    s = n*b
else:
    s =  b*((1-q**n)/(1-q))

print(f'Сумма {n} первых чисел геомерической прогрессии равна:{s}')