# Вводим необходимые данные
n = int(input("Введите число, которое вы хотите проверить на простоту "))
flag = True                        # переменная-переключательм для определения простоты числа 

if n == 1:
    print('Число 1 и не простое и не составное')
elif n == 2:
    print('Число 2 является первым простым числом')
else:
    if n%2 != 0:
        for i in range(3, int(n**0.5)+1, 2):             # проверяем все числа от 3 до квадратного корня из чиса которое мы проверяем с шагом 2
            if n % i == 0:
                flag = False                               # если проверяемое число делится хоть на одно из чисел взятых из лиапозона то оно составное 
    else:
        flag = False

if flag == True and n not in {1,2}:                                        # проверям переменную-переключатель и выводим ответ
    print(f'Число {n} простое число')
elif flag == False and n not in {1,2}:
    print(f'Число {n} составное число')